#include "Application/CApplication.h"
#include <iostream>
using namespace std;
int main(int argc, char * argv[]){

    CApplication application;
    application.run();

    return 0;
}

//написать давиду с вопросом или просьбой о консультации как нужно сделать пресунути/опаковане/COptional print cRequired print
//может ли так быть import? там просто формат не самый красивый, но она работает и работает как по мне довольно хорошо, если делать это всё одной строкой,
// то это тоже возможно, но там вероятность плохого ввода больше, у нас семестралка не об этом что бы сделать супер пупер ошетршени вступа
///presunuti сделать
///гледат найблизжи можный термин
///наставит удалост опаковане
///сделать выписы календаря

///тесты
///ошетршени вступу



